-- 기술 분류는 나중에 다시 정해야 할듯요? 일단 기능 구현할 땐 아무거나 넣고 나중에 정리할게여
INSERT INTO TECHNOLOGY_CATEGORY
(
  name
, is_deleted
, ref_technology_category_id
)
VALUES
( 'PC', 'N', NULL)
, ('모바일', 'N', NULL)
, ('AI', 'N', 1)
, ('웹', 'N', 2)
, ('게임', 'N', 1)
, ('보안', 'N', 2)
, ('기타', 'N', NULL);

INSERT INTO MATCHING 
(
  created_date_at
, is_completed
, level_range,
 member_id
, technology_category_id
) 
VALUES
('2024-03-01 10:30:00', 'N', 5, 1, 1),
('2024-03-02 12:45:00', 'N', 4, 2, 3),
('2024-03-03 15:00:00', 'Y', 6, 3, 2),
('2024-03-04 09:20:00', 'N', 3, 4, 5),
('2024-03-05 14:10:00', 'Y', 7, 5, 4),
('2024-03-06 17:30:00', 'N', 5, 6, 2),
('2024-03-07 11:00:00', 'N', 4, 7, 2),
('2024-03-08 16:40:00', 'N', 6, 8, 5),
('2024-03-09 08:55:00', 'Y', 3, 9, 4),
('2024-03-10 13:25:00', 'N', 5, 10, 1);

INSERT INTO MATCHING_ENTRY 
(
  applied_date_at
, is_canceled
, member_id
, matching_id
) 
VALUES
('2024-03-01 11:00:00', 'N', 1, 1),
('2024-03-02 13:00:00', 'N', 2, 2),
('2024-03-03 15:30:00', 'Y', 3, 3),
('2024-03-04 10:10:00', 'N', 4, 4),
('2024-03-05 14:40:00', 'N', 5, 5),
('2024-03-06 18:20:00', 'N', 6, 3),
('2024-03-07 12:30:00', 'Y', 7, 5),
('2024-03-08 17:50:00', 'N', 8, 2),
('2024-03-09 09:15:00', 'N', 9, 5),
('2024-03-10 14:00:00', 'N', 10, 4);